---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.CurveRoofSkippedLoopsWarn
source: html/bfc94904-f852-cafd-68dd-7a04c2337204.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.CurveRoofSkippedLoopsWarn Property

Some loops were skipped

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveRoofSkippedLoopsWarn { get; }
```